In [33]:
# Dependencies
import pandas as pd

In [34]:
# Store filepath in a variable
df = "cities.csv"

In [35]:
# Read our Data file with the pandas library
# Not every CSV requires an encoding, but be aware this can come up
df_pd = pd.read_csv(file_one, encoding="ISO-8859-1")

In [36]:
# Show just the header
df_pd = df_pd[["City","Lat","Lng","Temp","Humidity","Cloudiness","Wind","Country","Date"]]
df_pd

,City,Lat,Lng,Temp,Humidity,Cloudiness,Wind,Country,Date
0,vila velha,-20.3297,-40.2925,86.00,66,20,12.66,BR,1612639871
1,albany,42.6001,-73.9662,37.40,35,75,13.80,US,1612639930
2,tiruvidaimarudur,10.9960,79.4521,68.00,89,0,7.40,IN,1612639930
3,ushuaia,-54.8000,-68.3000,55.40,67,20,21.85,AR,1612639930
4,bethel,41.3712,-73.4140,42.80,31,40,13.80,US,1612639660
...,...,...,...,...,...,...,...,...,...
558,san vicente,-26.6167,-54.1333,79.93,37,0,6.53,AR,1612639994
559,tessalit,20.1986,1.0114,75.96,17,71,9.46,ML,1612639994
560,chara,56.9064,118.2631,-14.46,73,100,0.54,RU,1612639705
561,buin,-33.7333,-70.7500,71.60,60,0,8.05,CL,1612639994
562,coihaique,-45.5752,-72.0662,77.00,33,75,4.61,CL,1612639988

In [37]:
cities_table_df = df_pd.to_html()

In [38]:
text_file = open("cities_table_df", "w")
text_file.write(cities_table_df)
text_file.close()

   id first_name  last_name                    email  gender
0   1      David     Jordan         djordan0@home.pl    Male
1   2    Stephen      Riley  sriley1@hugedomains.com    Male
2   3     Evelyn      Grant  egrant2@livejournal.com  Female
3   4        Joe    Mendoza         jmendoza3@un.org    Male
4   5   Benjamin  Rodriguez   brodriguez4@elpais.com    Male

In [8]:
# Export file as a CSV, without the Pandas index, but with the header
file_one_df.to_